<?php
return [
    /**岗位
     */
    'post' => [
        ['id'=>11,'name'=>'财务组',],
        ['id'=>12,'name'=>'运营组',],
        ['id'=>13,'name'=>'客服组',],
        ['id'=>14,'name'=>'网购组',],
        ['id'=>15,'name'=>'咨询组',],
        ['id'=>16,'name'=>'护理组',],
    ],
    /**职务
     */
    'duty' => [
        ['id'=>61,'name'=>'总监',],
        ['id'=>62,'name'=>'经理',],
        ['id'=>63,'name'=>'顾问',],
        ['id'=>64,'name'=>'专员',],
    ],
    /**鉴权
     */
    'authentication' => [
        'store_operation' => [
            'id'=>81,
            'name'=>'店铺运营',
            'nodes'=>[
                ['id'=>811,'name'=>'商品管理','url'=>'',],
                ['id'=>812,'name'=>'场景管理','url'=>'',],
                ['id'=>813,'name'=>'特价管理','url'=>'',],
                ['id'=>814,'name'=>'上架管理','url'=>'',],
                ['id'=>815,'name'=>'下架管理','url'=>'',],
            ],
        ],'pre_sale' => [
            'id'=>100,
            'name'=>'售前客服',
            'nodes'=>[
                ['id'=>1001,'name'=>'售前咨询','url'=>'',],
            ],
        ],'in_sale' => [
            'id'=>120,
            'name'=>'售中客服',
            'nodes'=>[
                ['id'=>1201,'name'=>'接单打印','url'=>'',],
                ['id'=>1201,'name'=>'接单打印','url'=>'',],
                ['id'=>1201,'name'=>'接单打印','url'=>'',],
                ['id'=>1201,'name'=>'接单打印','url'=>'',],
            ],
        ],
    ],
];