<?php
/**type    分组：  1：系统 2：财务 3：运营 4：客服 5：网购 6：咨询 7：护理
 */
return [
    'system' => [
        ['id'=>1,'name'=>'拥有者','type'=>1,],
        ['id'=>2,'name'=>'管理员','type'=>1,],
        ['id'=>3,'name'=>'店长','type'=>1,],
    ],'finance' => [
        ['id'=>11,'name'=>'财务总监','type'=>2,],
        ['id'=>12,'name'=>'财务经理','type'=>2,],
        ['id'=>13,'name'=>'财务顾问','type'=>2,],
        ['id'=>14,'name'=>'财务专员','type'=>2,],
    ],'operation' => [
        ['id'=>21,'name'=>'运营总监','type'=>3,],
        ['id'=>22,'name'=>'运营经理','type'=>3,],
        ['id'=>23,'name'=>'运营顾问','type'=>3,],
        ['id'=>24,'name'=>'运营专员','type'=>3,],
    ],'customer' => [
        ['id'=>31,'name'=>'客服总监','type'=>4,],
        ['id'=>32,'name'=>'客服经理','type'=>4,],
        ['id'=>33,'name'=>'客服顾问','type'=>4,],
        ['id'=>34,'name'=>'客服专员','type'=>4,],
    ],'shopping' => [
        ['id'=>41,'name'=>'网购总监','type'=>5,],
        ['id'=>42,'name'=>'网购经理','type'=>5,],
        ['id'=>43,'name'=>'网购顾问','type'=>5,],
        ['id'=>44,'name'=>'网购专员','type'=>5,],
    ],'consult' => [
        ['id'=>51,'name'=>'咨询总监','type'=>6,],
        ['id'=>52,'name'=>'咨询经理','type'=>6,],
        ['id'=>53,'name'=>'咨询顾问','type'=>6,],
        ['id'=>54,'name'=>'咨询专员','type'=>6,],
    ],'nurse' => [
        ['id'=>61,'name'=>'护理总监','type'=>7,],
        ['id'=>62,'name'=>'护理经理','type'=>7,],
        ['id'=>63,'name'=>'护理顾问','type'=>7,],
        ['id'=>64,'name'=>'护理专员','type'=>7,],
    ],
];